WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  if(isFirstTime)
  {
    isFirstTime = false;

    // (--) Diag config LED
    stm32_configgpio(DEBUG_PIN_V2_D06);
    // (--) Diag LED
  }

  // 0 = illegal
  // 1 = Configure without Duty Cycle (reduces interrupts by 50%),
  // 2 = Configure with Duty Cycle,
  // 3 = Unconfigure
  switch(mdwCfgTimerChan->configOption)
  {
    case MEADOW_MEAS_FREQ_CONF_OPTION_NO_DC:
      chanNeedsDuty = false;
      break;

    case MEADOW_MEAS_FREQ_CONF_OPTION_WITH_DC:
      chanNeedsDuty = true;
      break;
     
     // Unconfigure - Also removes Timer if no channels are left
    case MEADOW_MEAS_FREQ_CONF_OPTION_UNCFG:
      ret = meadow_measure_freq_unconfigure(mdwCfgTimerChan);
      return ret;   // Function not implemented

    default:
      syslog(2, "%s@%d-Unknown configure option:%llu\n",
                __FILE__, __LINE__, mdwCfgTimerChan->configOption);
      return MEADOW_MEAS_FREQ_CONF_UNDEFINED_OPTION;   // Function not implemented
  }

  if(timerNumber > 14 || timerNumber < 1)
  {
    syslog(2, "%s@%d-Timer must be 1 - 14\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_CONF_TIM_NUMB_ILLEGAL;
  }
  
  if(channelNumber > 4 || channelNumber < 1)
  {
    syslog(2, "%s@%d-Channel must be 1 - 4\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_CONF_CHAN_NUMB_ILLEGAL;
  }

  // Insure a valid timer, channel, port+pin combination was supplied.
  // Timers have, at most, 1-4 channels, each representing 1 GPIO. For the
  // specified timer we need to verify a proper port and pin.
  uint8_t chanValid4TimerPortPin = meadow_measure_freq_get_chan_tim_port_pin(
            timerNumber, portAndPin);
  if(chanValid4TimerPortPin == 0)
  {
    syslog(2, "%s@%d-The Port and Pin, not valid for timer %d\n",
              __FILE__, __LINE__, timerNumber);
    return MEADOW_MEAS_FREQ_CONF_PORT_PIN_NOT_FOR_TIM;
  }

  // Is this the channel the user wanted?
  if(channelNumber != chanValid4TimerPortPin)
  {
    syslog(2, "%s@%d-The Port/Pin/Timer/Channel combination, not valid\n",
              __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_CONF_PORT_PIN_TIM_CHAN_INVALID;
  }

  // Check if this timer is useable and get a pointer if it is
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Timer %ld cannot be used\n",
              __FILE__, __LINE__, timerNumber);
    return MEADOW_MEAS_FREQ_CONF_TIM_NOT_USABLE;
  }

  // Are any channels active? If not, timer needs to be initialized
  if(mdwFreqTimerInfo->chanActiveBits == 0)
    timerNeedsConfig = true;
  else
    timerNeedsConfig = false;

  // This timer is usable, but is this channel already being used?
  uint8_t chanBit = meadow_measure_freq_get_chan_bit_set(channelNumber);
  if(mdwFreqTimerInfo->chanActiveBits & chanBit)
  {
    syslog(LOG_ERR, "%s@%d-Timer %d, channel %d already in use\n",
              __FILE__, __LINE__, timerNumber, channelNumber);
    return MEADOW_MEAS_FREQ_CONF_TIM_CHAN_IN_USE;
  }

  // Allocate a struct for each new channel on a timer
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset] =
            (mdwFreqChanData_t*)zalloc(sizeof(mdwFreqChanData_t));
  if(mdwFreqTimerInfo->mdwFreqChanData[channelOffset] == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Allocation for mdwFreqChanData_s NULL\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_CONF_CHAN_MEM_ALLOC_FAILED;
  }

  // Start populating the channel structure
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->useDutyCycle = chanNeedsDuty;

  // Init time and count used to calculate average frequency
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->gpioCountForAvg = 0;
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->startTimeForAvg =
            meadow_measure_freq_get_current_time();

  // Indicate this channel is being used
  mdwFreqTimerInfo->chanActiveBits |= chanBit;    // Set channel bit

  // Build the GPIO input configuration for Nuttx GPIO processing
  inputGpioConfig = MEADOW_TIMER_GPIO_CONST | portAndPin | \
            mdwFreqTimerInfo->timerAltFunc;

  // // Diagnostic
  // syslog(1, "-->%s@%d-TIM%lu, Chn:%lu, input Pin defn:0x%02x (P%c%d), Pin defn+AF:0x%08lx\n",
  //           __FILE__, __LINE__, timerNumber, channelNumber, portAndPin,
  //           ((portAndPin) >> 4) + 'A', portAndPin & 0x0f, inputGpioConfig);
  // // Diagnostic

  // Valid GPIO so configure input for channel.
  ret = stm32_configgpio(inputGpioConfig);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:stm32_configgpio() returned:%ld\n",
              __FILE__, __LINE__, ret);
    free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
    return MEADOW_MEAS_FREQ_CONF_CONFIGGPIO_ERR;   // Not supported
  }

  // Save GPIO configuration
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->inputConfig
            = inputGpioConfig;

  // Initialized the F7's channel hardware for this GPIO input 
  ret = meadow_measure_freq_cfg_channel_hardware(mdwFreqTimerInfo,
          mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow channel hardware init failed:%d\n",
              __FILE__, __LINE__, ret);
    free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
    return MEADOW_MEAS_FREQ_CONF_INIT_CHAN_HW_FAIL;
  }

  // Initialized the F7's timer hardware
  if(timerNeedsConfig)
  {
    // Initialized the F7's timer hardware
    ret = meadow_measure_freq_cfg_timer_hardware(mdwFreqTimerInfo);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Meadow timer hardware init failed:%d\n",
                __FILE__, __LINE__, ret);
      free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
      return MEADOW_MEAS_FREQ_CONF_INIT_TIM_HW_FAIL;
    }
  }

  return MEADOW_MEAS_FREQ_CONF_SUCCESSFUL;
}

//============================================================
// Configuration of timer channel hardware registers.
int meadow_measure_freq_cfg_channel_hardware(
          mdwFreqTimerInfo_t *mdwFreqTimerInfo,
          mdwFreqChanData_t *mdwFreqChanData)
{
  uint32_t regVal32;
  uint16_t ccerRegVal;    // Capture/Compare Enable Register
  uint16_t dierRegVal;    // DMA/Interrupt Enable Register
  
  if(mdwFreqTimerInfo == NULL)
    return -ENXIO;

  bool useDC = mdwFreqChanData->useDutyCycle;
  uint32_t timerBase = mdwFreqTimerInfo->timerBase;

  ccerRegVal = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  dierRegVal = 0; // getreg16(timerBase + STM32_GTIM_DIER_OFFSET);
  
