WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  if(mdwCfgTimerChan->channelNumber > 4 || mdwCfgTimerChan->channelNumber < 1)
  {
    syslog(2, "%s@%d-Channel must be 1 - 4\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_UNCFG_INVALID_CHANNEL_NUMB;
  }

  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(mdwCfgTimerChan->timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Couldn't get TimerInfo from timer number:%lu\n",
          __FILE__, __LINE__, mdwCfgTimerChan->timerNumber);
    return MEADOW_MEAS_FREQ_UNCFG_TIMER_ACCESS_NULL;
  }

syslog(1, "--> Entry and active channels:0x%02x\n",
          mdwFreqTimerInfo->chanActiveBits);

  uint32_t timerBase = mdwFreqTimerInfo->timerBase;

  // Is the channel configured?
  uint8_t channelBit = meadow_measure_freq_get_chan_bit_set(
          mdwCfgTimerChan->channelNumber);
  if((mdwFreqTimerInfo->chanActiveBits & channelBit) == 0)
  {
    syslog(1, "%s@%d-Rqst unconfigure, channel not configured\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_UNCFG_CHAN_NOT_CONFIG;
  }

  mdwFreqChanData_t *mdwFreqChanData =
            mdwFreqTimerInfo->mdwFreqChanData[channelOffset];
  if(mdwFreqChanData == NULL)
  {
    syslog(1, "%s@%d-Channel data NULL\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_UNCFG_NO_CHANNEL;
  }

syslog(1, "--> Disabling Timer IRQ & Timer, active channels:0x%02x\n",
          mdwFreqTimerInfo->chanActiveBits);

  // Stop interrupts
  up_disable_irq(mdwFreqTimerInfo->timerIrqVec);

  // Stop timer
  meadow_measure_freq_disable(mdwFreqTimerInfo->timerBase);

  // Unconfigure channel hardware
  ccerRegVal = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  dierRegVal = getreg16(timerBase + STM32_GTIM_DIER_OFFSET);
  channelBit = mdwFreqTimerInfo->chanActiveBits;

  switch(mdwCfgTimerChan->channelNumber)
  {
    case FREQ_CHANNEL_NUMBER_CHAN_1:
      channelBit &= ~ACTIVE_CHAN_BITFIELD_1;  // Clear channel field
      ccerRegVal &= ~GTIM_CCER_CC1E;          // Disable capture channel 1
      dierRegVal &= ~GTIM_DIER_CC1IE;         // DMA/Interrupt disable
      break;
    case FREQ_CHANNEL_NUMBER_CHAN_2:
      channelBit &= ~ACTIVE_CHAN_BITFIELD_2;
      ccerRegVal &= ~GTIM_CCER_CC2E;
      dierRegVal &= ~GTIM_DIER_CC2IE;
      break;
    case FREQ_CHANNEL_NUMBER_CHAN_3:
      channelBit &= ~ACTIVE_CHAN_BITFIELD_3;
      ccerRegVal &= ~GTIM_CCER_CC3E;
      dierRegVal &= ~GTIM_DIER_CC3IE;
      break;
    case FREQ_CHANNEL_NUMBER_CHAN_4:
      channelBit &= ~ACTIVE_CHAN_BITFIELD_4;
      ccerRegVal &= ~GTIM_CCER_CC4E;
      dierRegVal &= ~GTIM_DIER_CC4IE;
      break;
  }

  putreg16(ccerRegVal, timerBase + STM32_GTIM_CCER_OFFSET);
  putreg16(dierRegVal, timerBase + STM32_GTIM_DIER_OFFSET); 
  mdwFreqTimerInfo->chanActiveBits = channelBit;

syslog(1, "--> Channels adjusted active channels:0x%02x\n",
          mdwFreqTimerInfo->chanActiveBits);

  // Unconfigure GPIO
  stm32_unconfiggpio(mdwFreqChanData->inputConfig);

  // Is the timer left with any active channels?
  if(channelBit == 0)
  {
    syslog(1, "--> Need to remove Timer, active channels:0x%02x\n",
              mdwFreqTimerInfo->chanActiveBits);

    // Stop the timer clock
    uint32_t apbClock = meadow_measure_freq_get_apb_clock(mdwFreqTimerInfo);
    modifyreg32(apbClock, mdwFreqTimerInfo->timerClkEn, 0);

    // Detach ISR
    ret = irq_detach(mdwFreqTimerInfo->timerIrqVec);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-irq_detach failed, ret:%d, errno:%d\n",
            __FILE__, __LINE__, ret, errno);
      return MEADOW_MEAS_FREQ_UNCFG_IRQ_DETACH_ERR;
    }
    mdwFreqTimerInfo->timerOverflow = 0;
  }
  else
  {
    syslog(1, "==> Re-enabling Timer, active channels:0x%02x\n",
              mdwFreqTimerInfo->chanActiveBits);

    // Re-enable interrupts
    up_enable_irq(mdwFreqTimerInfo->timerIrqVec);

    // Restart timer
    meadow_measure_freq_enable(mdwFreqTimerInfo->timerBase);
  }

  // Free channel runtime memory
  free(mdwFreqChanData);
  mdwFreqChanData = NULL;

  return MEADOW_MEAS_FREQ_UNCFG_SUCCESSFUL;
}

//================================================================
// Return Frequency and Duty Cycle information to caller.
// Moved as much processing here as apposed to the ISR.
int meadow_measure_freq_return_freq_info(mdwFreqReturnData_t *returnData)
{
  // 64 bytes of stack space
  double dblFrequency;
  double dblDutyCycle;
  double dblTotalInputCount;
  double dblAvgFreq;
  uint64_t halfCycle;
  uint64_t fullCycle;
  uint64_t regOvrFloTimSize;
  uint64_t bgnCapture;
  uint64_t midCapture;
  uint64_t endCapture;
  uint64_t totalCaptureTime;
  uint64_t endCaptureTime = meadow_measure_freq_get_current_time();

  // Verify that provided timer and channel are valid
  if(returnData->timerNumber > 14 || returnData->timerNumber < 1)
  {
    syslog(2, "%s@%d-Timer must be 1 - 14\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_INVALID_TIMER_NUMB;
  }

  if(returnData->channelNumber > 4 || returnData->channelNumber < 1)
  {
    syslog(2, "%s@%d-Channel must be 1 - 4\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_INVALID_CHANNEL_NUMB;
  }

  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(returnData->timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Couldn't get TimerInfo from timer number:%lu\n",
          __FILE__, __LINE__, returnData->timerNumber);
    return MEADOW_MEAS_FREQ_READ_TIMER_ACCESS_NULL;
  }

  syslog(1, "-->Returning data-for timer:%lu, channel:%lu, active channels:0x%02x\n",
            returnData->timerNumber, returnData->channelNumber,
            mdwFreqTimerInfo->chanActiveBits);

  // Is the channel configured?
  uint8_t channelBit = meadow_measure_freq_get_chan_bit_set(
          returnData->channelNumber);
  if((mdwFreqTimerInfo->chanActiveBits & channelBit) == 0)
  {
    syslog(1, "%s@%d-Unconfigured channel accessed\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_CHAN_NOT_CONFIG;
  }

  mdwFreqChanData_t *mdwFreqChanData =
            mdwFreqTimerInfo->mdwFreqChanData[returnData->channelNumber - 1];
  if(mdwFreqChanData == NULL)
  {
    syslog(1, "%s@%d-Channel data NULL\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_READ_CHANNEL_DATA_NULL;
  }

  // Does this timer have any channels?
  if(mdwFreqTimerInfo->chanActiveBits == 0)
  {
    // This should be impossible state
    syslog(1, "No channels active\n");
    return MEADOW_MEAS_FREQ_READ_NO_CHANS_ACTIVE;
  }

  // Any activity since last this code was last executed?
  if(mdwFreqChanData->gpioCountForAvg == 0)
  {
    returnData->dutyCycleX1000  = 0;
    returnData->frequencyX1000  = 0;
    returnData->avgFreqX1000    = 0;
    // Reset capture time for next average
    mdwFreqChanData->startTimeForAvg = meadow_measure_freq_get_current_time();

    syslog(1, "No freq input since last check\n");
    return MEADOW_MEAS_FREQ_READ_NO_INPUT_DETECTED;
  }

  //-------------------------------------------------------
  // We need the timer's width to do the overflow math
  if(mdwFreqTimerInfo->timerWidth)
    regOvrFloTimSize = MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
  else
    regOvrFloTimSize = MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;

  uint64_t ovrFloStartCnt = mdwFreqChanData->bgnResultOvr;

  // Add in the overflow counts
  bgnCapture = mdwFreqChanData->bgnResultCnt + \
        ((mdwFreqChanData->bgnResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  midCapture = mdwFreqChanData->midResultCnt + \
        ((mdwFreqChanData->midResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  endCapture = mdwFreqChanData->endResultCnt + \
        ((mdwFreqChanData->endResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  
  // Normalize from the beginning
  fullCycle = endCapture - bgnCapture;
  halfCycle = midCapture - bgnCapture;

  // To help preserve resolution, use floating point math.
  // syslog(1, "==>%s@%d-Snapshot-bgnCapture:%llu, full Count:%llu, half Count:%llu, inputTotal:%llu\n",
  //           __FILE__, __LINE__, bgnCapture,
  //           fullCycle, halfCycle,
  //           mdwFreqChanData->gpioCountForAvg);

  // Duty Cycle is the ratio of the full cycle count and the cycle count
  // before the trailing edge was detected.
  if(mdwFreqChanData->useDutyCycle)
    dblDutyCycle = (((double)halfCycle) * 100.0) / ((double)fullCycle);
  else
    dblDutyCycle = 0;
    
  // The dblFrequency is the timer's clock divided by the cycle count.
  dblFrequency = ((double)MEADOW_FREQ_CLOCK_FREQ) / ((double)fullCycle);

  // Average frequency since last read calculations
  totalCaptureTime = endCaptureTime - mdwFreqChanData->startTimeForAvg;

  // Convert time in nanoseconds to fractional seconds
  double dblTotalCaptureTime = ((double) totalCaptureTime) / (1000.0 * 1000.0 * 1000.0);
  dblTotalInputCount = (double)mdwFreqChanData->gpioCountForAvg;
  dblAvgFreq = ((double)dblTotalInputCount) / dblTotalCaptureTime;

  // syslog(1, "==>In Code-Freq:%06.2fHz, DC:%02.2f%%, AvgFreq:%06.4f, Count:%lu\n",
  //           dblFrequency, dblDutyCycle, dblAvgFreq,
  //           (uint32_t)dblTotalInputCount);

  if(mdwFreqChanData->useDutyCycle)
    returnData->dutyCycleX1000  = (dblDutyCycle * 1000.0);
  else
    returnData->dutyCycleX1000  = 0;

  returnData->frequencyX1000    = (dblFrequency * 1000.0);
  returnData->avgFreqX1000      = (dblAvgFreq   * 1000.0);
  returnData->gpioCountForAvg   = (uint32_t)dblTotalInputCount;

  // Reset capture counts and Meadow time for next average
  mdwFreqChanData->gpioCountForAvg = 0;
  mdwFreqChanData->startTimeForAvg = meadow_measure_freq_get_current_time();

  return MEADOW_MEAS_FREQ_READ_SUCCESSFUL;
}
